Re-Avadhut/ResQNet/firmware/sdkconfig.defaults
# This file was generated using `idf.py save-defconfig`
# It can be edited to track configuration changes
# or to set options that are not in the menuconfig

# ESP-IDF
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

# Wi-Fi
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_AP_ENABLED=y
CONFIG_ESP32_WIFI_STA_ENABLED=y
CONFIG_WIFI_SSID="ResQNet-Node-01"
CONFIG_WIFI_PASSWORD="resqnet123"
CONFIG_WIFI_CHANNEL=6
CONFIG_WIFI_MAX_AP_CONN=4

# Captive portal
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=512

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# NVS for storage
CONFIG_NVS_ENCRYPTION=n

# OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_OTA_ALLOW_HTTP=y

# FreeRTOS
CONFIG_FREERTOS_HZ=100
